app/controllers/restaurants_controller.rb

SELECT "restaurants".* FROM "restaurants"
---
  def index
    restaurant= Restaurant.all

SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    restaurant  = Restaurant.find_by(id: params[:id])