app/controllers/restaurant_pizzas_controller.rb

SELECT "restaurant_pizzas".* FROM "restaurant_pizzas"
---
  def index
    restaurantpizza=RestaurantPizza.all

INSERT INTO "restaurant_pizzas" ("price", "pizza_id", "restaurant_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["price", 5], ["pizza_id", "1"], ["restaurant_id", "3"], ["created_at", "2022-11-25 20:21:15.674660"], ["updated_at", "2022-11-25 20:21:15.674660"]]
---
  def create
    restaurantpizza = RestaurantPizza.create(rest_params)

SELECT "pizzas".* FROM "pizzas" WHERE "pizzas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def update
    restaurantpizza  = RestaurantPizza.find_by(id: params[:id])